Revit 2026 API

# MetallicPaintMetallicpaintPearlIor Property

---

The property labeled "Blend" from the "MetallicPaint" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MetallicpaintPearlIor { get; }
```
```vb
Public Shared ReadOnly Property MetallicpaintPearlIor As String
	Get
```
```cpp
public:
static property String^ MetallicpaintPearlIor {
	String^ get ();
}
```
```fsharp
static member MetallicpaintPearlIor : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 1".

#### Reference

MetallicPaint Class

Autodesk.Revit.DB.Visual Namespace